cmusv/ArduinoBoards/boards/powerdue/boards.txt
power_due_x.name=PowerDue (Target Port)
power_due_x.vid.0=0x2341
power_due_x.pid.0=0x003e
power_due_x.vid.1=0x2A03
power_due_x.pid.1=0x003e
power_due_x.upload.tool=bossac
power_due_x.upload.protocol=sam-ba
power_due_x.upload.maximum_size=524288
power_due_x.upload.use_1200bps_touch=true
power_due_x.upload.wait_for_upload_port=true
power_due_x.upload.native_usb=true
power_due_x.build.mcu=cortex-m3
power_due_x.build.f_cpu=84000000L
power_due_x.build.usb_product="PowerDue"
power_due_x.build.board=SAM_DUE
power_due_x.build.core=arduino
power_due_x.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
power_due_x.build.ldscript=linker_scripts/gcc/flash.ld
power_due_x.build.variant=arduino_due_x
power_due_x.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
power_due_x.build.vid=0x2341
power_due_x.build.pid=0x003e

power_due_x_inst.name=PowerDue (Instrument Port)
power_due_x_inst.vid.0=0x2341
power_due_x_inst.pid.0=0x003e
power_due_x_inst.vid.1=0x2A03
power_due_x_inst.pid.1=0x003e
power_due_x_inst.upload.tool=bossac
power_due_x_inst.upload.protocol=sam-ba
power_due_x_inst.upload.maximum_size=524288
power_due_x_inst.upload.use_1200bps_touch=true
power_due_x_inst.upload.wait_for_upload_port=true
power_due_x_inst.upload.native_usb=true
power_due_x_inst.build.mcu=cortex-m3
power_due_x_inst.build.f_cpu=84000000L
power_due_x_inst.build.usb_product="PowerDue"
power_due_x_inst.build.board=SAM_DUE
power_due_x_inst.build.core=arduino
power_due_x_inst.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
power_due_x_inst.build.ldscript=linker_scripts/gcc/flash.ld
power_due_x_inst.build.variant=arduino_due_x
power_due_x_inst.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
power_due_x_inst.build.vid=0x2341
power_due_x_inst.build.pid=0x003e
